Revit 2027 API
EnergyAnalysisDetailModel.GetAnalyticalShadingSurfaces Method
Note: This API is now obsolete.
 The collection of analytical shading surfaces.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("GetAnalyticalShadingSurfaces is deprecated in Revit 2027 and may be removed in the next version of Revit. Instead use GetAnalyticalSurfaces().Where(surface => surface.Type == gbXMLSurfaceType.Shade).")]
public IList<EnergyAnalysisSurface> GetAnalyticalShadingSurfaces()
<ObsoleteAttribute("GetAnalyticalShadingSurfaces is deprecated in Revit 2027 and may be removed in the next version of Revit. Instead use GetAnalyticalSurfaces().Where(surface => surface.Type == gbXMLSurfaceType.Shade).")>
Public Function GetAnalyticalShadingSurfaces As IList(Of EnergyAnalysisSurface)
public:
[ObsoleteAttribute(L"GetAnalyticalShadingSurfaces is deprecated in Revit 2027 and may be removed in the next version of Revit. Instead use GetAnalyticalSurfaces().Where(surface => surface.Type == gbXMLSurfaceType.Shade).")]
IList<EnergyAnalysisSurface^>^ GetAnalyticalShadingSurfaces()
[<ObsoleteAttribute("GetAnalyticalShadingSurfaces is deprecated in Revit 2027 and may be removed in the next version of Revit. Instead use GetAnalyticalSurfaces().Where(surface => surface.Type == gbXMLSurfaceType.Shade).")>]
member GetAnalyticalShadingSurfaces : unit -> IList<EnergyAnalysisSurface>
Return Value
IList<EnergyAnalysisSurface>
 Returns the analytical shading surfaces after model calculation.
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace